import { Department, Role } from "./types";

export const DEPARTMENTS: Department[] = Object.values(Department);
export const ROLES: Role[] = Object.values(Role);

export const MISSION_CHECKLISTS = [
  {
    category: 'ماموریت آپدیت نرم افزار',
    steps: [
      'دانلود آخرین نسخه برنامه (اشتراک‌گذاری در شبکه)',
      'نصب SQL Compare 12 (درصورت نیاز)',
      'انتقال فایل‌های آپدیت به فولدر Senik Update',
      'گرفتن بکاپ از دیتابیس‌ها با رعایت استاندارد',
      'گرفتن Old از فولدر فایل‌های اجرایی با رعایت استاندارد',
      'آپدیت دیتابیس‌ها با رعایت استاندارد',
      'کپی فایل نسخه جدید به فولدر اجرایی با رعایت استاندارد',
      'بررسی بکاپ و بکاپ اتوماتیک و راه‌اندازی درصورت نیاز',
      'بررسی صحت اجرای برنامه و اصلاح تنظیمات درصورت نیاز',
    ],
  },
  {
    category: 'آموزش حضوری',
    subcategories: [
        {
            category: 'حسابداری بازرگانی',
            steps: [
              'آموزش اطلاعات پایه',
              'آموزش مدیریت انبار',
              'آموزش مدیریت حسابداری',
              'آموزش عملیات سند',
              'آموزش عملیات فاکتور',
              'آموزش عملیات چک',
              'آموزش گزارشات',
              'آموزش مدیریت سیستم',
              'آموزش عملیات پایان سال',
            ],
        },
        {
            category: 'حسابداری صنعتی',
            steps: [
              'آموزش ورود اطلاعات پایه',
              'آموزش چک و سفته',
              'آموزش انبارداری',
              'آموزش عملیات ویژه',
              'آموزش صدور فاکتور',
              'آموزش گزارشات',
              'آموزش مدیریت سیستم',
              'آموزش عملیات پایان سال',
            ],
        },
        {
            category: 'فروشگاهی',
            steps: [
              'آموزش حسابداری',
              'آموزش صندوق‌داری',
            ],
        },
        {
            category: 'رستورانی',
            steps: [
              'آموزش حسابداری',
              'آموزش سفارش‌گیری',
            ],
        },
        {
            category: 'مودیان',
            steps: [
              'مودیان',
            ],
        },
        {
            category: "ماژول ها",
            steps: [
              "حقوق و دستمزد",
              "هتل و تالار",
              "تسهیلات",
              "استهلاک",
              "بودجه",
              "سهام",
              "بیمه",
              "مراکز هزینه و پروژه",
              "باشگاه مشتریان",
              "اشتراک و بن کارت",
              "پخش (ویزیتوری)",
              "پذیرش (خودرو)",
              "پیگیری (فروش)",
              "عملیات ارزی",
              "کلوب بازی",
              "پنل پیامکی",
              "سه نیک بانک"
            ]
        },
        {
            category: "سایر",
            steps:[
              "سایر"
            ]
        },
    ]
  },
  {
    category: 'ماموریت نصب نرم افزار',
    steps: [
      'کنترل درایو نصب جهت داشتن فضای کافی (درایو D)',
      'فولدر‌بندی استاندارد سه نیک',
      'کپی فایل‌های نصب در فولدر مناسب با رعایت استاندارد',
      'کپی فایل‌های اجرایی در فولدر مناسب با رعایت استاندارد',
      'غیرفعال کردن Windows Defender Firewall',
      'نصب Microsoft .NET Framework 3.5.9',
      'نصب Microsoft SQL Server 2014',
      'نصب Crystal Reports 2008.10.5',
      'نصب Stimulsoft Reports 2013.2',
      'نصب SQL Compare 12',
      'نصب Persian Fonts',
      'نصب AnyDesk (ست کردن پسورد با رضایت مشتری)',
      'تغییر نام  sa به senik  اعمال تنظیمات امنیتی SQL',
      'ایجاد Shortcut برنامه روی دسکتاپ و اصلاح نام',
      'Attach کردن دیتابیس با نام استاندارد',
      'تنظیم کانکت برنامه‌های اجرایی',
      'اعمال نیوبانک و فعال‌سازی برنامه',
      'اعمال مجوزدهی آما و تنظیمات سیستم',
      'ساخت کاربر admin در برنامه با رعایت استاندارد',
      'ثبت مسیر بکاپ و راه‌اندازی بکاپ اتوماتیک',
      'ایجاد یوزر سه نیک پوشه اشتراکی و استاتیک کردن آیپی',
    ],
  },
  {
    category: 'ماموریت راه اندازی',
    steps: [],
    isDynamic: true,
  },
  {
    category: 'ماموریت رفع مشکل',
    steps: [],
    isDynamic: true,
  },
  
];